#lang apply
#|
    譯
    Copyright (C) 2017-2018  Zaoqi

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU Affero General Public License as published
    by the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Affero General Public License for more details.

    You should have received a copy of the GNU Affero General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
|#
(定 ^空態 '())
(定 ^空局態 '())
(定 ^空 ''())
(定 (^^數字量 局態 態 式 續) ; (入 (局態 態 句列 式)
   (續 局態 態 '() 式))
(定 ^^數 ^^數字量)
(定 ^^字 ^^數字量)
(定 ^^量 ^^數字量)
(定 (^^入前 局態 態 參 續) (續 ^空局態 局態 態)) ; (入 (局態內 局態 態)
(定 (^^入 局態內 局態 態 參 句列 續) (續 局態 態 '() `(lambda ,參 ,@句列))) ; (入 (局態 態 句列 式)
(定 (^^定入前 局態 態 定名 參 續) (續 ^空局態 局態 態)) ; (入 (局態內 局態 態)
(定 (^^定入 局態內 局態 態 定名 參 句列 續) (續 局態 態 `(define ,定名 (lambda ,參 ,@句列)))); (入 (局態 態 句列)
(定 (^^定 局態 態 定名 式 續) (續 局態 態 `(define ,定名 ,式))) ; (入 (局態 態 句列)
(定 (^^若 局態 態 陰陽 陽句列 陽 陰句列 陰 續) ; (入 (局態 態 句列 式)
   (續 局態 態 '() `(if ,陰陽
                    ,(若 (空？ 陽句列) 陽 `(begin ,@陽句列 ,陽))
                    ,(若 (空？ 陰句列) 陰 `(begin ,@陰句列 ,陰)))))
(定 (^^用 局態 態 函 參 續) (續 局態 態 '() `(,函 ,@參))) ; (入 (局態 態 句列 式)
(定 (^^尾式 局態 態 式 續) (續 局態 態 (列 式))) ; (入 (局態 態 句列)
(定 (^^尾若 局態 態 陰陽 陽句列 陰句列 續) ; (入 (局態 態 句列)
   (續 局態 態 `((if ,陰陽
                 ,(若 (空？ (尾 陽句列)) (首 陽句列) `(begin ,@陽句列))
                 ,(若 (空？ (尾 陰句列)) (首 陰句列) `(begin ,@陰句列))))))
(定 (^^尾用 局態 態 函 參 續) (續 局態 態 `((,函 ,@參)))) ; (入 (局態 態 句列)
(定 (^^式 局態 態 式 續) (續 局態 態 (列 式))) ; (入 (局態 態 句列)
(定 (^^整 局態 態 句列) 句列)
(定 (^^符 局態 態 符 續) (續 局態 態 `(quote ,符))) ; (入 (局態 態 句列 式)
;---
; 這裏手動CPS比values簡單
(定 (譯 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句列 式)
   (譯詞法
    局態-址 局態-境 局態 態-塊集 態 式
    (入 (局態-址 局態-境 局態 態-塊集 態 式)
       (若.
        [(首尾？ 式)
         (名 ([式首 (首 式)] [式尾 (尾 式)])
            (若等.
             式首
             [(符^)
              (^^符
               局態 態 (第一 式尾)
               (入 (局態 態 句列 式)
                  (續 局態-址 局態-境 局態 態-塊集 態 句列 式)))]
             [(定^ 定詞法^) (誤 "譯：上下文錯誤" 式)]
             [(入^)
              (名 ([參 (首 式尾)] [體 (尾 式尾)])
                 (^^入前
                  局態 態 參
                  (入 (局態內 局態 態)
                     (譯尾始
                      局態-址 局態-境 局態內 態-塊集 態 體
                      (入 (局態內-址 局態內-境 局態內 態-塊集 態 句列)
                         (^^入
                          局態內 局態 態 參 句列
                          (入 (局態 態 句列 式)
                             (續 局態-址 局態-境 局態 態-塊集 態 句列 式))))))))]
             [(始^) (譯始 局態-址 局態-境 局態 態-塊集 態 式尾 續)]
             [(若^)
              (譯
               局態-址 局態-境 局態 態-塊集 態 (第一 式尾)
               (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 陰陽)
                  (譯
                   局態-址 局態-境 局態 態-塊集 態 (第二 式尾)
                   (入 (局態-址 局態-境 局態 態-塊集 態 陽句列 陽)
                      (譯
                       局態-址 局態-境 局態 態-塊集 態 (第三 式尾)
                       (入 (局態-址 局態-境 局態 態-塊集 態 陰句列 陰)
                          (^^若
                           局態 態 陰陽 陽句列 陽 陰句列 陰
                           (入 (局態 態 句列乙 式)
                              (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙) 式)))))))))]
             [_
              (譯
               局態-址 局態-境 局態 態-塊集 態 式首
               (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 函)
                  (譯.
                   局態-址 局態-境 局態 態-塊集 態 式尾
                   (入 (局態-址 局態-境 局態 態-塊集 態 句列乙 參)
                      (^^用
                       局態 態 函 參
                       (入 (局態 態 句列丙 式)
                          (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙 句列丙) 式)))))))]))]
        [(空？ 式) (續 局態-址 局態-境 局態 態-塊集 態 '() ^空)]
        [否則 ((若.
              [(數？ 式) ^^數]
              [(字？ 式) ^^字]
              [(符？ 式) ^^量]
              [否則 (誤 "譯：詞法錯誤" 式)])
             局態 態 式
             (入 (局態 態 句列 式)
                (續 局態-址 局態-境 局態 態-塊集 態 句列 式)))]))))
(定表 詞法
    (詞法 源 入)
    詞法？
    (源 詞法-源)
    (入 詞法-入))
; (: 局態-境 (映 符 詞法))
(定 (譯詞法 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 式)
   (若 (首尾？ 式)
      (名 ([式首 (首 式)] [式尾 (尾 式)])
         (名 ([法 (映-取 局態-境 式首 陰)])
            (若 法
               (譯詞法 局態-址 局態-境 局態 態-塊集 態 (用 (詞法-入 法) 式尾) 續)
               (續 局態-址 局態-境 局態 態-塊集 態 式))))
      (續 局態-址 局態-境 局態 態-塊集 態 式)))
(定 (譯尾 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句列)
   (定 (@)
      (譯
       局態-址 局態-境 局態 態-塊集 態 式
       (入 (局態-址 局態-境 局態 態-塊集 態 句列 式)
          (^^尾式
           局態 態 式
           (入 (局態 態 式句列)
              (續 局態-址 局態-境 局態 態-塊集 態 (連 句列 式句列)))))))
   (譯詞法
    局態-址 局態-境 局態 態-塊集 態 式
    (入 (局態-址 局態-境 局態 態-塊集 態 式)
       (若.
        [(首尾？ 式)
         (名 ([式首 (首 式)] [式尾 (尾 式)])
            (若等.
             式首
             [(定^ 定詞法^) (誤 "譯：上下文錯誤" 式)]
             [(入^ 符^) (@)]
             [(始^) (譯尾始 局態-址 局態-境 局態 態-塊集 態 式尾 續)]
             [(若^)
              (譯
               局態-址 局態-境 局態 態-塊集 態 (第一 式尾)
               (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 陰陽)
                  (譯尾
                   局態-址 局態-境 局態 態-塊集 態 (第二 式尾)
                   (入 (局態-址 局態-境 局態 態-塊集 態 陽句列)
                      (譯尾
                       局態-址 局態-境 局態 態-塊集 態 (第三 式尾)
                       (入 (局態-址 局態-境 局態 態-塊集 態 陰句列)
                          (^^尾若
                           局態 態 陰陽 陽句列 陰句列
                           (入 (局態 態 句列乙)
                              (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙))))))))))]
             [_
              (譯
               局態-址 局態-境 局態 態-塊集 態 式首
               (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 函)
                  (譯.
                   局態-址 局態-境 局態 態-塊集 態 式尾
                   (入 (局態-址 局態-境 局態 態-塊集 態 句列乙 參)
                      (^^尾用
                       局態 態 函 參
                       (入 (局態 態 句列丙)
                          (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙 句列丙))))))))]))]
        [否則 (@)]))))
(定 (譯尾始 局態-址 局態-境 局態 態-塊集 態 式列 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句列)
   (若 (等？ 式列 陽)
      (續 局態-址 局態-境 局態 態-塊集 態 '()) ; 部分計算
      (名 ([式 (首 式列)] [式列尾 (尾 式列)])
         (若.
          [(空？ 式列尾) (譯尾 局態-址 局態-境 局態 態-塊集 態 式 續)]
          [否則 (譯詞法
               局態-址 局態-境 局態 態-塊集 態 式
               (入 (局態-址 局態-境 局態 態-塊集 態 式)
                  (若.
                   [(首尾？ 式)
                    (名 ([式首 (首 式)] [式尾 (尾 式)])
                       (若等.
                        式首
                        [(始^) (譯尾始 局態-址 局態-境 局態 態-塊集 態 (連 式尾 式列尾) 續)]
                        [(定詞法^) (譯尾始 局態-址 (映-改 局態-境 (第一 式尾) (詞法 (第二 式尾) (算 (第二 式尾)))) 局態 態-塊集 態 式列尾 續)]
                        [(定^)
                         (名 ([定名 (第一 式尾)] [值 (第二 式尾)])
                            (若 (皆 (首尾？ 值) (等？ (首 值) '入))
                               (名 ([參 (首 (尾 值))] [體 (尾 (尾 值))])
                                  (^^定入前
                                   局態 態 定名 參
                                   (入 (局態內 局態 態)
                                      (譯尾始
                                       局態-址 局態-境 局態內 態-塊集 態 體
                                       (入 (局態內-址 局態內-境 局態內 態-塊集 態 句列)
                                          (^^定入
                                           局態內 局態 態 定名 參 句列
                                           (入 (局態 態 句列甲)
                                              (譯尾始
                                               局態-址 局態-境 局態 態-塊集 態 式列尾
                                               (入 (局態-址 局態-境 局態 態-塊集 態 句列乙)
                                                  (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙)))))))))))
                               (譯
                                局態-址 局態-境 局態 態-塊集 態 值
                                (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 式)
                                   (^^定
                                    局態 態 定名 式
                                    (入 (局態 態 句列乙)
                                       (譯尾始
                                        局態-址 局態-境 局態 態-塊集 態 式列尾
                                        (入 (局態-址 局態-境 局態 態-塊集 態 句列丙)
                                           (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙 句列丙))))))))))]
                        [_ (譯
                            局態-址 局態-境 局態 態-塊集 態 式
                            (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 式)
                               (^^式
                                局態 態 式
                                (入 (局態 態 句列乙)
                                   (譯尾始
                                    局態-址 局態-境 局態 態-塊集 態 式列尾
                                    (入 (局態-址 局態-境 局態 態-塊集 態 句列丙)
                                       (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙 句列丙))))))))]))]
                   [否則 (譯尾始 局態-址 局態-境 局態 態-塊集 態 式列尾 續)])))]))))
(定 (譯始 局態-址 局態-境 局態 態-塊集 態 式列 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句列 式)
   (名 ([式 (首 式列)] [式列尾 (尾 式列)])
      (若.
       [(空？ 式列尾) (譯 局態-址 局態-境 局態 態-塊集 態 式 續)]
       [(首尾？ 式)
        (譯
         局態-址 局態-境 局態 態-塊集 態 式
         (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 式)
            (^^式
             局態 態 式
             (入 (局態 態 句列乙)
                (譯始
                 局態-址 局態-境 局態 態-塊集 態 式列尾
                 (入 (局態-址 局態-境 局態 態-塊集 態 句列丙 式)
                    (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙 句列丙) 式)))))))]
       [否則 (譯始 局態-址 局態-境 局態 態-塊集 態 式列尾 續)])))
(定 (譯. 局態-址 局態-境 局態 態-塊集 態 式列 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句列 式列)
   (若 (空？ (尾 式列))
      (譯
       局態-址 局態-境 局態 態-塊集 態 (首 式列)
       (入 (局態-址 局態-境 局態 態-塊集 態 句列 式)
          (續 局態-址 局態-境 局態 態-塊集 態 句列 (列 式))))
      (譯
       局態-址 局態-境 局態 態-塊集 態 (首 式列)
       (入 (局態-址 局態-境 局態 態-塊集 態 句列甲 式)
          (譯.
           局態-址 局態-境 局態 態-塊集 態 (尾 式列)
           (入 (局態-址 局態-境 局態 態-塊集 態 句列乙 式列)
              (續 局態-址 局態-境 局態 態-塊集 態 (連 句列甲 句列乙) (首尾 式 式列))))))))
(定 预定 (嵌式列 "預.應語"))
(定 预 ; (續 局態-址 局態-境 局態 態-塊集 態 句列)
   (名 ([甲 (譯尾始 '|| 空映 ^空局態 空映 ^空態 `(,@预定 . ,陽) 列)])
      (入 (續)
         (用 續 甲))))
(定 (譯全 局態-址 式列)
   (预
    (入 (_局態-址 局態-境 局態 態-塊集 態 句列甲)
       (譯尾始
        局態-址 局態-境 局態 態-塊集 態 式列
        (入 (局態-址 局態-境 局態 態-塊集 態 句列乙)
           (^^整 局態 態 (連 句列甲 句列乙)))))))
(定 (譯-無预 局態-址 式列)
   (预
    (入 (_局態-址 局態-境 局態 態-塊集 態 句列甲)
       (譯尾始
        局態-址 局態-境 局態 態-塊集 態 式列
        (入 (局態-址 局態-境 局態 態-塊集 態 句列乙)
           (^^整 局態 態 句列乙))))))
