#lang s-exp "_.rkt"
(定 (譯 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句集 式)
   (譯詞法
    局態-址 局態-境 局態 態-塊集 態 式
    (入 (局態-址 局態-境 局態 態-塊集 態 式)
       (若.
        [(首尾？ 式)
         (名 ([式首 (首 式)] [式尾 (尾 式)])
            (若等. 式首
             [(定z)
              (名 ([定名 (第一 式尾)] [值 (第二 式尾)])
                 (若 (皆 (首尾？ 值) (等？ (首 值) '入))
                    (名 ([參 (首 (尾 值))] [體 (尾 (尾 值))])
                    (^^定入前
                     局態 態 定名 參
                     (入 (局態內 態)
                        (尾始
                         局態-址 局態-境 局態內 態-塊集 態 體
                         (入 (局態內-址 局態內-境 局態內 態-塊集 態 句集)
                            (^^定入
                             局態內 局態 態 定名 參 句集
                             (入 (局態 態 句集)
                                (續 局態-址 局態-境 局態 態-塊集 態 句集 ^無))))))))
                    (譯
                     局態-址 局態-境 局態 態-塊集 態 值
                     (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 式)
                        (^^定
                         局態 態 定名 式
                         (入 (局態 態 句集乙)
                           (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙) ^無)
                         