#lang s-exp "_.rkt"
; 這裏手動CPS比values簡單
(定 (譯 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句集 式)
   (譯詞法
    局態-址 局態-境 局態 態-塊集 態 式
    (入 (局態-址 局態-境 局態 態-塊集 態 式)
       (若.
        [(首尾？ 式)
         (名 ([式首 (首 式)] [式尾 (尾 式)])
            (若等.
             式首
             [(定z)
              (名 ([定名 (第一 式尾)] [值 (第二 式尾)])
                 (若 (皆 (首尾？ 值) (等？ (首 值) '入))
                    (名 ([參 (首 (尾 值))] [體 (尾 (尾 值))])
                       (^^定入前
                        局態 態 定名 參
                        (入 (局態內 局態 態)
                           (譯尾始
                            局態-址 局態-境 局態內 態-塊集 態 體
                            (入 (局態內-址 局態內-境 局態內 態-塊集 態 句集)
                               (^^定入
                                局態內 局態 態 定名 參 句集
                                (入 (局態 態 句集)
                                   (續 局態-址 局態-境 局態 態-塊集 態 句集 ^無))))))))
                    (譯
                     局態-址 局態-境 局態 態-塊集 態 值
                     (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 式)
                        (^^定
                         局態 態 定名 式
                         (入 (局態 態 句集乙)
                            (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙) ^無)))))))]
             [(入)
              (名 ([參 (首 式尾)] [體 (尾 式尾)])
                 (^^入前
                  局態 態 參
                  (入 (局態內 局態 態)
                     (尾始
                      局態-址 局態-境 局態內 態-塊集 態 體
                      (入 (局態內-址 局態內-境 局態內 態-塊集 態 句集)
                         (^^入
                          局態內 局態 態 參 句集
                          (入 (局態 態 句集 式)
                             (續 局態-址 局態-境 局態 態-塊集 態 句集 式))))))))]
             [(始) (譯始 局態-址 局態-境 局態 態-塊集 態 式尾 續)]
             [(若)
              (譯
               局態-址 局態-境 局態 態-塊集 態 (第一 式尾)
               (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 陰陽)
                  (譯
                   局態-址 局態-境 局態 態-塊集 態 (第二 式尾)
                   (入 (局態-址 局態-境 局態 態-塊集 態 陽句集 陽)
                      (譯
                       局態-址 局態-境 局態 態-塊集 態 (第三 式尾)
                       (入 (局態-址 局態-境 局態 態-塊集 態 陰句集 陰)
                          (^^若
                           局態 態 陰陽 陽句集 陽 陰句集 陰
                           (入 (局態 態 句集乙 式)
                              (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙) 式)))))))))]
             [_
              (譯
               局態-址 局態-境 局態 態-塊集 態 式首
               (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 函)
                  (譯.
                   局態-址 局態-境 局態 態-塊集 態 式尾
                   (入 (局態-址 局態-境 局態 態-塊集 態 句集乙 參)
                      (^^用
                       局態 態 函 參
                       (入 (局態 態 句集丁 式)
                          (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙 句集丙 句集丁) 式)))))))]))]
        [(空？ 式) ^空]
        [否則 ((若.
              [(數？ 式) ^^數]
              [(字？ 式) ^^字]
              [(串？ 式) ^^串]
              [(符？ 式) ^^量]
              [否則 (錯 "譯：詞法錯誤" 式)])
             局態 態 式
             (入 (局態 態 句集 式)
                (續 局態-址 局態-境 局態 態-塊集 態 句集 式)))]))))
(定表 詞法
    (詞法 源 入)
    詞法？
    (源 詞法-源)
    (入 詞法-入))
; (: 局態-境 (映 符 詞法))
(定 (譯詞法 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 式)
   (若 (首尾？ 式)
      (名 ([式首 (首 式)] [式尾 (尾 式)])
         (名 ([法 (映-取 局態-境 式首 陰)])
            (若 法
               (譯詞法 局態-址 局態-境 局態 態-塊集 態 (用 法 式尾) 續)
               (續 局態-址 局態-境 局態 態-塊集 態 式))))
      (續 局態-址 局態-境 局態 態-塊集 態 式)))
(定 (譯尾 局態-址 局態-境 局態 態-塊集 態 式 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句集)
   (定 (@)
      (譯
       局態-址 局態-境 局態 態-塊集 態 式
         (入 (局態-址 局態-境 局態 態-塊集 態 句集 式)
            (^^尾式
             局態 態 式
             (入 (局態 態 式句集)
                (續 局態-址 局態-境 局態 態-塊集 態 (連 句集 式句集)))))))
   (譯詞法
    局態-址 局態-境 局態 態-塊集 態 式
    (入 (局態-址 局態-境 局態 態-塊集 態 式)
       (若.
        [(首尾？ 式)
         (名 ([式首 (首 式)] [式尾 (尾 式)])
            (若等.
             式首
             [(定z) (錯 "譯：上下文錯誤" 式)]
             [(入) (@)]
             [(始) (譯尾始 局態-址 局態-境 局態 態-塊集 態 式尾 續)]
             [(若)
              (譯
               局態-址 局態-境 局態 態-塊集 態 (第一 式尾)
               (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 陰陽)
                  (譯尾
                   局態-址 局態-境 局態 態-塊集 態 (第二 式尾)
                   (入 (局態-址 局態-境 局態 態-塊集 態 陽句集)
                      (譯尾
                       局態-址 局態-境 局態 態-塊集 態 (第三 式尾)
                       (入 (局態-址 局態-境 局態 態-塊集 態 陰句集)
                          (^^尾若
                           局態 態 陰陽 陽句集 陰句集
                           (入 (局態 態 句集乙)
                              (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙))))))))))]
             [_
              (譯
               局態-址 局態-境 局態 態-塊集 態 式首
               (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 函)
                  (譯.
                   局態-址 局態-境 局態 態-塊集 態 式尾
                   (入 (局態-址 局態-境 局態 態-塊集 態 句集乙 參)
                      (^^尾用
                       局態 態 函 參
                       (入 (局態 態 句集丁)
                          (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙 句集丙 句集丁))))))))]))]
        [否則 (@)]))))
(定 (譯尾始 局態-址 局態-境 局態 態-塊集 態 集 續) ; (續 局態-址 局態-境 局態 態-塊集 態 句集)
   (若 (空？ (尾 集))
      (譯尾 局態-址 局態-境 局態 態-塊集 態 (首 集) 續)
      (譯
       局態-址 局態-境 局態 態-塊集 態 (首 集)
       (入 (局態-址 局態-境 局態 態-塊集 態 句集甲 式)
          (譯尾始
           局態-址 局態-境 局態 態-塊集 態 (尾 集)
           (入 (局態-址 局態-境 局態 態-塊集 態 句集乙)
              (若 (等？ ^無 式)
                 (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集乙))
                 (^^式
                  局態 態 式
                  (入 (局態 態 句集丙)
                     (續 局態-址 局態-境 局態 態-塊集 態 (連 句集甲 句集丙 句集乙))
             
